"""
На входе многомерный список, каждый элемент содержит информацию о товаре,
количестве и цене, которые были в каком-то заказе. Например: [[Товар1, 1,500],[Товар2,
7,1000],[Товар1, 6,900]]
Вывести словарь:{Товар:Общая сумма заказа}
"""

order = [['Товар1', 1, 500], ['Товар2', 7, 1000],
         ['Товар1', 6, 900], ['Товар3', 5, 100],
         ['Товар2', 3, 1000], ['Товар3', 1, 1],
         ['Товар3', 3, 1000], ['Товар1', 1, 1],
         ['Товар4', 2, 500], ['Товар4', 1, 50053]]


def total_amount(array):
    order_dict = {}
    for elem in array:
        name_product = elem[0]
        sum_of_order = elem[1] * elem[2]
        order_dict[name_product] = order_dict.get(name_product, 0) + sum_of_order
    print(order_dict)
    return order_dict


if __name__ == '__main__':
    total_amount(order)
